SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32BG26/Include/efr32bg26_mvp.h
#define MVP_INSTRCFG2_ALUOP_SQRMAGC2                    (_MVP_INSTRCFG2_ALUOP_SQRMAGC2 << 20)     /**< Shifted mode SQRMAGC2 for MVP_INSTRCFG2     */
#define MVP_INSTRCFG2_ALUOP_PRELU2B                     (_MVP_INSTRCFG2_ALUOP_PRELU2B << 20)      /**< Shifted mode PRELU2B for MVP_INSTRCFG2      */
#define MVP_INSTRCFG2_ALUOP_MACC                        (_MVP_INSTRCFG2_ALUOP_MACC << 20)         /**< Shifted mode MACC for MVP_INSTRCFG2         */
#define MVP_INSTRCFG2_ALUOP_AACC                        (_MVP_INSTRCFG2_ALUOP_AACC << 20)         /**< Shifted mode AACC for MVP_INSTRCFG2         */
#define MVP_INSTRCFG2_ALUOP_ELU2A                       (_MVP_INSTRCFG2_ALUOP_ELU2A << 20)        /**< Shifted mode ELU2A for MVP_INSTRCFG2        */
#define MVP_INSTRCFG2_ALUOP_ELU2B                       (_MVP_INSTRCFG2_ALUOP_ELU2B << 20)        /**< Shifted mode ELU2B for MVP_INSTRCFG2        */
#define MVP_INSTRCFG2_ALUOP_IFR2A                       (_MVP_INSTRCFG2_ALUOP_IFR2A << 20)        /**< Shifted mode IFR2A for MVP_INSTRCFG2        */
#define MVP_INSTRCFG2_ALUOP_IFR2B                       (_MVP_INSTRCFG2_ALUOP_IFR2B << 20)        /**< Shifted mode IFR2B for MVP_INSTRCFG2        */
#define MVP_INSTRCFG2_ALUOP_MAXAC2                      (_MVP_INSTRCFG2_ALUOP_MAXAC2 << 20)       /**< Shifted mode MAXAC2 for MVP_INSTRCFG2       */
#define MVP_INSTRCFG2_ALUOP_MINAC2                      (_MVP_INSTRCFG2_ALUOP_MINAC2 << 20)       /**< Shifted mode MINAC2 for MVP_INSTRCFG2       */
#define MVP_INSTRCFG2_ALUOP_CLIP2A                      (_MVP_INSTRCFG2_ALUOP_CLIP2A << 20)       /**< Shifted mode CLIP2A for MVP_INSTRCFG2       */
#define MVP_INSTRCFG2_ALUOP_CLIP2B                      (_MVP_INSTRCFG2_ALUOP_CLIP2B << 20)       /**< Shifted mode CLIP2B for MVP_INSTRCFG2       */
#define MVP_INSTRCFG2_ALUOP_MACR2A                      (_MVP_INSTRCFG2_ALUOP_MACR2A << 20)       /**< Shifted mode MACR2A for MVP_INSTRCFG2       */
#define MVP_INSTRCFG2_ALUOP_MACR2B                      (_MVP_INSTRCFG2_ALUOP_MACR2B << 20)       /**< Shifted mode MACR2B for MVP_INSTRCFG2       */
#define MVP_INSTRCFG2_ALUOP_IFC                         (_MVP_INSTRCFG2_ALUOP_IFC << 20)          /**< Shifted mode IFC for MVP_INSTRCFG2          */
#define MVP_INSTRCFG2_ENDPROG                           (0x1UL << 31)                             /**< End of Program                              */
#define _MVP_INSTRCFG2_ENDPROG_SHIFT                    31                                        /**< Shift value for MVP_ENDPROG                 */
#define _MVP_INSTRCFG2_ENDPROG_MASK                     0x80000000UL                              /**< Bit mask for MVP_ENDPROG                    */
#define _MVP_INSTRCFG2_ENDPROG_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for MVP_INSTRCFG2              */
#define MVP_INSTRCFG2_ENDPROG_DEFAULT                   (_MVP_INSTRCFG2_ENDPROG_DEFAULT << 31)    /**< Shifted mode DEFAULT for MVP_INSTRCFG2      */

/* Bit fields for MVP CMD */
#define _MVP_CMD_RESETVALUE                             0x00000000UL                    /**< Default value for MVP_CMD                   */
#define _MVP_CMD_MASK                                   0x0000000FUL                    /**< Mask for MVP_CMD                            */
#define MVP_CMD_START                                   (0x1UL << 0)                    /**< Start Command                               */
#define _MVP_CMD_START_SHIFT                            0                               /**< Shift value for MVP_START                   */
#define _MVP_CMD_START_MASK                             0x1UL                           /**< Bit mask for MVP_START                      */
#define _MVP_CMD_START_DEFAULT                          0x00000000UL                    /**< Mode DEFAULT for MVP_CMD                    */
#define MVP_CMD_START_DEFAULT                           (_MVP_CMD_START_DEFAULT << 0)   /**< Shifted mode DEFAULT for MVP_CMD            */
#define MVP_CMD_HALT                                    (0x1UL << 1)                    /**< Halt Command                                */
#define _MVP_CMD_HALT_SHIFT                             1                               /**< Shift value for MVP_HALT                    */
#define _MVP_CMD_HALT_MASK                              0x2UL                           /**< Bit mask for MVP_HALT                       */
#define _MVP_CMD_HALT_DEFAULT                           0x00000000UL                    /**< Mode DEFAULT for MVP_CMD                    */
#define MVP_CMD_HALT_DEFAULT                            (_MVP_CMD_HALT_DEFAULT << 1)    /**< Shifted mode DEFAULT for MVP_CMD            */
#define MVP_CMD_STEP                                    (0x1UL << 2)                    /**< Step Command                                */
#define _MVP_CMD_STEP_SHIFT                             2                               /**< Shift value for MVP_STEP                    */
#define _MVP_CMD_STEP_MASK                              0x4UL                           /**< Bit mask for MVP_STEP                       */
#define _MVP_CMD_STEP_DEFAULT                           0x00000000UL                    /**< Mode DEFAULT for MVP_CMD                    */
#define MVP_CMD_STEP_DEFAULT                            (_MVP_CMD_STEP_DEFAULT << 2)    /**< Shifted mode DEFAULT for MVP_CMD            */
#define MVP_CMD_INIT                                    (0x1UL << 3)                    /**< Initialization Command/Qualifier            */
#define _MVP_CMD_INIT_SHIFT                             3                               /**< Shift value for MVP_INIT                    */
#define _MVP_CMD_INIT_MASK                              0x8UL                           /**< Bit mask for MVP_INIT                       */
#define _MVP_CMD_INIT_DEFAULT                           0x00000000UL                    /**< Mode DEFAULT for MVP_CMD                    */
#define MVP_CMD_INIT_DEFAULT                            (_MVP_CMD_INIT_DEFAULT << 3)    /**< Shifted mode DEFAULT for MVP_CMD            */

